In [1]:
import pandas as pd
import numpy as np
import calendar

12. How to convert a series of date-strings to a timeseries?

In [2]:
a=['01jan2010', '02-02-2011', '20120303','2013/04/04', '2014-05-05','2015-06-06T12:20']

In [3]:
from datetime import datetime
from dateutil.parser import parse

In [4]:
pd.to_datetime(a)

DatetimeIndex(['2010-01-01 00:00:00', '2011-02-02 00:00:00',
               '2012-03-03 00:00:00', '2013-04-04 00:00:00',
               '2014-05-05 00:00:00', '2015-06-06 12:20:00'],
              dtype='datetime64[ns]', freq=None)

In [5]:
[parse(x) for x in a]

[datetime.datetime(2010, 1, 1, 0, 0),
 datetime.datetime(2011, 2, 2, 0, 0),
 datetime.datetime(2012, 3, 3, 0, 0),
 datetime.datetime(2013, 4, 4, 0, 0),
 datetime.datetime(2014, 5, 5, 0, 0),
 datetime.datetime(2015, 6, 6, 12, 20)]

13. Get the day of month, week number, day of year and day of week from ser

In [6]:
data=pd.DataFrame(a, columns=['date'])

In [7]:
data.dtypes

date    object
dtype: object

In [11]:
data['datetime']=pd.to_datetime(data['date'])
data

               date            datetime
0         01jan2010 2010-01-01 00:00:00
1        02-02-2011 2011-02-02 00:00:00
2          20120303 2012-03-03 00:00:00
3        2013/04/04 2013-04-04 00:00:00
4        2014-05-05 2014-05-05 00:00:00
5  2015-06-06T12:20 2015-06-06 12:20:00

In [16]:
data=data.drop(['date'], axis=1)

In [17]:
data['day']=data.apply(lambda x: x['datetime'].day, axis=1)
data

             datetime  day
0 2010-01-01 00:00:00    1
1 2011-02-02 00:00:00    2
2 2012-03-03 00:00:00    3
3 2013-04-04 00:00:00    4
4 2014-05-05 00:00:00    5
5 2015-06-06 12:20:00    6

In [18]:
data['week']=data.apply(lambda x: x['datetime'].weekday(), axis=1)
data

             datetime  day  week
0 2010-01-01 00:00:00    1     4
1 2011-02-02 00:00:00    2     2
2 2012-03-03 00:00:00    3     5
3 2013-04-04 00:00:00    4     3
4 2014-05-05 00:00:00    5     0
5 2015-06-06 12:20:00    6     5

In [19]:
data['weekday']=data.apply(lambda x: x['datetime'].day_name(), axis=1)
data

             datetime  day  week    weekday
0 2010-01-01 00:00:00    1     4     Friday
1 2011-02-02 00:00:00    2     2  Wednesday
2 2012-03-03 00:00:00    3     5   Saturday
3 2013-04-04 00:00:00    4     3   Thursday
4 2014-05-05 00:00:00    5     0     Monday
5 2015-06-06 12:20:00    6     5   Saturday

15. how to create a time series starting from '2000-01-01' and 10 weekends. (saturday and sunday)

In [22]:
date_range=pd.date_range(start='1/1/2000', periods=10, freq='W')
date_range

DatetimeIndex(['2000-01-02', '2000-01-09', '2000-01-16', '2000-01-23',
               '2000-01-30', '2000-02-06', '2000-02-13', '2000-02-20',
               '2000-02-27', '2000-03-05'],
              dtype='datetime64[ns]', freq='W-SUN')

16. import every 50th row of boston housing dataset and make a dateframe

In [26]:
from sklearn.datasets import load_boston

In [30]:
boston=load_boston()

In [32]:
df_bos=pd.DataFrame(boston.data, columns=boston.feature_names)
df_bos.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33

In [34]:
print(df_bos.shape)

(506, 13)

In [35]:
df_50=df_bos[df_bos.index%50==0]

In [36]:
df_50

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
50,0.08873,21.0,5.64,0.0,0.439,5.963,45.7,6.8147,4.0,243.0,16.8,395.56,13.45
100,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42
150,1.65660,0.0,19.58,0.0,0.871,6.122,97.3,1.6180,5.0,403.0,14.7,372.80,14.10
200,0.01778,95.0,1.47,0.0,0.403,7.135,13.9,7.6534,3.0,402.0,17.0,384.30,4.45
250,0.14030,22.0,5.86,0.0,0.431,6.487,13.0,7.3967,7.0,330.0,19.1,396.28,5.90
300,0.04417,70.0,2.24,0.0,0.400,6.871,47.4,7.8278,5.0,358.0,14.8,390.86,6.07
350,0.06211,40.0,1.25,0.0,0.429,6.490,44.4,8.7921,1.0,335.0,19.7,396.90,5.98
400,25.04610,0.0,18.10,0.0,0.693,5.987,100.0,1.5888,24.0,666.0,20.2,396.90,26.77
450,6.71772,0.0,18.10,0.0,0.713,6.749,92.6,2.3236,24.0,666.0,20.2,0.32,17.44
500,0.22438,0.0,9.69,0.0,0.585,6.027,79.7,2.4982,6.0,391.0,19.2,396.90,14.33

3.

In [38]:
ser1=pd.Series([2,3,4,5])
ser2=pd.Series([5,6,7,8])

In [46]:
A=pd.Series([lambda x: x in ser1==ser2])

In [47]:
A

0    <function <lambda> at 0x0769B8A0>
dtype: object